// Блок 1. Основы (уроки 1-67). Задания 1-169.

// Задание 167. Создайте переменную `a`. Запишите в нее значение `10`, выведите его на экран. Затем запишите в нее значение `20`, выведите его на экран.
{
	let a = 10;
	alert(a); // 10
	a = 20;
	alert(a); // 20
}

// Задание 168. Самостоятельно опробуйте все описанные способы объявления переменных.
{
	let a = 1;
	let b = 2;
	let c = 3;

	let d = 4, e = 5, f = 6;

	let g, h, i;
	g = 7;
	h = 8;
	i = 9;
}

// Задание 169. Создайте переменную `num` и присвойте ей значение `123`. Выведите значение этой переменной на экран с помощью функции `alert`.
{
	let num = 123;
	alert(num);
}

// Задание 160. Создайте переменную `str` и присвойте ей строку `'!!!'`. Выведите значение этой переменной на экран.
{
	let str = '!!!';
	alert(str);
}

// Задание 17. Попробуйте оба типа комментариев.
{
	// однострочный комментарий
	/*
		многострочный
	*/
	alert('text');
}

// Задание 18. Дана переменная. Выведите в консоль ее значение.
{
	let num = 123;
	console.log(num);
}

// Задание 19. Даны три переменные. Выведите в консоль их значения.
{
	let num1 = 1;
	let num2 = 2;
	let num3 = 3;
	console.log(num1, num2, num3);
}

// Задание 20. Выведите в консоль все известные вам типы данных. Посмотрите, чем отличается их цвет.
{
	console.log(123);      // число
	console.log('123');    // строка
	console.log(true);     // логический тип
	console.log(undefined);// неопределённость
	console.log(null);     // ничего
	console.log(NaN);      // не число
	console.log(Infinity); // бесконечность
}

// Задание 21. Сознательно допустите ошибку в вашем коде. Убедитесь, что ошибка появляется в консоли. Определите, в какой строке кода случилась ошибка.
{
	alert(eee); // такой переменной нет
}

// Задание 77. Создайте переменную `a`. Запишите в нее сумму чисел `1`, `2` и `3`. С помощью функции `alert` выведите на экран содержимое переменной `a`.
{
	let a = 1 + 2 + 3;
	alert(a);
}

// Задание 88. Создайте переменную `a` со значением `10` и переменную `b` со значением `2`. Выведите на экран их сумму, разность, произведение и частное (результат деления).
{
	let a = 10;
	let b = 2;
	alert(a + b); // 12
	alert(a - b); // 8
	alert(a * b); // 20
	alert(a / b); // 5
}

// Задание 89. Создайте переменную `c` со значением `10` и переменную `d` со значением `5`. Просуммируйте их, а результат присвойте переменной `result`. Выведите на экран значение переменной `result`.
{
	let c = 10;
	let d = 5;
	let result = c + d;
	alert(result);
}

// Задание 90. Создайте переменную `a` со значением `1`, переменную `b` со значением `2` и переменную `c` со значением `3`. Выведите на экран их сумму.
{
	let a = 1;
	let b = 2;
	let c = 3;
	alert(a + b + c);
}

// Задание 91. Создайте переменную `a` со значением `10` и переменную `b` со значением `5`. Отнимите от `a` переменную `b` и результат присвойте переменной `c`. Затем создайте переменную `d`, присвойте ей значение `7`. Сложите переменные `c` и `d`, а результат запишите в переменную `result`. Выведите на экран значение переменной `result`.
{
	let a = 10;
	let b = 5;
	let c = a - b;
	let d = 7;
	let result = c + d;
	alert(result);
}

// Задание 59. Запишите в переменную `a` число `1.5`, а в переменную `b` - число `0.75`. Найдите сумму значений этих переменных и выведите ее на экран.
{
	let a = 1.5;
	let b = 0.75;
	let sum = a + b;
	alert(sum);
}

// Задание 105. Создайте переменную `a` со значением `-100`. Выведите это значение на экран.
{
	let a = -100;
	alert(a);
}

// Задание 106. Создайте переменную `a`, запишите в нее какое-нибудь положительное или отрицательное число. Выведите на экран это число с обратным знаком.
{
	let a = 50;
	alert(-a);
}

// Задание 84. Не запуская код, определите, что выведется на экран: `let a = 5 + 5 * 3; alert(a);`
{
	let a = 5 + 5 * 3;
	alert(a);
}

// Задание 85. Не запуская код, определите, что выведется на экран: `let a = 5 + 5 * 3 + 3; alert(a);`
{
	let a = 5 + 5 * 3 + 3;
	alert(a);
}

// Задание 86. Не запуская код, определите, что выведется на экран: `let a = 8 / 2 + 2; alert(a);`
{
	let a = 8 / 2 + 2;
	alert(a);
}

// Задание 87. Не запуская код, определите, что выведется на экран: `let a = 8 + 2 / 2; alert(a);`
{
	let a = 8 + 2 / 2;
	alert(a);
}

// Задание 75. Не запуская код, определите, что выведется на экран: `let a = 8 / 2 * 2; alert(a);`
{
	let a = 8 / 2 * 2;
	alert(a);
}

// Задание 76. Не запуская код, определите, что выведется на экран: `let a = 8 * 4 / 2 / 2; alert(a);`
{
	let a = 8 * 4 / 2 / 2;
	alert(a);
}

// Задание 78. Не запуская код, определите, что выведется на экран: `let a = (2 + 3) * (2 + 3); alert(a);`
{
	let a = (2 + 3) * (2 + 3);
	alert(a);
}

// Задание 79. Не запуская код, определите, что выведется на экран: `let a = (2 + 3) * 2 + 3; alert(a);`
{
	let a = (2 + 3) * 2 + 3;
	alert(a);
}

// Задание 80. Не запуская код, определите, что выведется на экран: `let a = 2 * (2 + 4 * (3 + 1)); alert(a);`
{
	let a = 2 * (2 + 4 * (3 + 1));
	alert(a);
}

// Задание 81. Не запуская код, определите, что выведется на экран: `let a = 2 * 8 / 4; alert(a);`
{
	let a = 2 * 8 / 4;
	alert(a);
}

// Задание 82. Не запуская код, определите, что выведется на экран: `let a = (2 * 8) / 4; alert(a);`
{
	let a = (2 * 8) / 4;
	alert(a);
}

// Задание 83. Не запуская код, определите, что выведется на экран: `let a = 2 * (8 / 4); alert(a);`
{
	let a = 2 * (8 / 4);
	alert(a);
}

// Задание 111. Возведите число `2` в `10`-ю степень. Выведите результат на экран.
{
	alert(2 ** 10);
}

// Задание 112. Не запуская код, определите, что выведется на экран: `let a = 3 * 2 ** 3; alert(a);`
{
	let a = 3 * 2 ** 3;
	alert(a);
}

// Задание 113. Не запуская код, определите, что выведется на экран: `let a = (3 * 2) ** 3; alert(a);`
{
	let a = (3 * 2) ** 3;
	alert(a);
}

// Задание 114. Не запуская код, определите, что выведется на экран: `let a = 3 * 2 ** (3 + 1); alert(a);`
{
	let a = 3 * 2 ** (3 + 1);
	alert(a);
}

// Задание 115. Не запуская код, определите, что выведется на экран: `let a = 2 ** 3 * 3; alert(a);`
{
	let a = 2 ** 3 * 3;
	alert(a);
}

// Задание 116. Не запуская код, определите, что выведется на экран: `let a = 3 * 2 ** 3 * 3; alert(a);`
{
	let a = 3 * 2 ** 3 * 3;
	alert(a);
}

// Задание 50. Найдите остаток от деления следующих переменных: `let a = 13; let b = 5;`
{
	let a = 13;
	let b = 5;
	let rest = a % b;
	alert(rest);
}

// Задание 8. Не запуская код, определите, что выведется на экран: `let a = '5' % '2'; alert(a);`
{
	let a = '5' % '2';
	alert(a);
}

// Задание 117. Не запуская код, определите, что выведется на экран: `let num = 1; num = num + 1; num = num + 1; alert(num);`
{
	let num = 1;
	num = num + 1;
	num = num + 1;
	alert(num);
}

// Задание 118. Не запуская код, определите, что выведется на экран: `let num = 1; num = num + 2; num = num + 3; alert(num);`
{
	let num = 1;
	num = num + 2;
	num = num + 3;
	alert(num);
}

// Задание 119. Переделайте этот код так, чтобы в нем использовались описанные сокращенные операции: `let num = 47; num = num + 7; num = num - 18; num = num * 10; num = num / 15; alert(num);`
{
	let num = 47;
	num += 7;
	num -= 18;
	num *= 10;
	num /= 15;
	alert(num);
}

// Задание 62. Переделайте этот код так, чтобы в нем операции инкремента и декремента: `let num = 10; num = num + 1; num = num + 1; num = num - 1; alert(num);`
{
	let num = 10;
	num++;
	num++;
	num--;
	alert(num);
}

// Задание 156. Создайте строку с вашем именем и строку с вашей фамилией. Выведите эти данные на экран.
{
	let name = 'Иван';
	let surname = 'Иванов';
	alert(name);
	alert(surname);
}

// Задание 161. Создайте переменную с текстом `'java'` и переменную с текстом `'script'`. С помощью этих переменных и операции сложения строк выведите на экран строку `'javascript'`.
{
	let str1 = 'java';
	let str2 = 'script';
	alert(str1 + str2);
}

// Задание 162. Создайте переменную с текстом `'hello'` и переменную с текстом `'world'`. С помощью этих переменных и операции сложения строк выведите на экран строку `'hello world'`.
{
	let str1 = 'hello';
	let str2 = 'world';
	alert(str1 + ' ' + str2);
}

// Задание 163. Запишите в переменную какую-нибудь строку. Выведите на экран длину вашей строки.
{
	let str = 'Привет, мир!';
	alert(str.length);
}

// Задание 164. Перепишите следующий код через вставку переменных: `let str1 = 'xxx'; let str2 = 'yyy'; let txt = 'aaa ' + str1 + ' bbb ' + str2 + ' ccc';`
{
	let str1 = 'xxx';
	let str2 = 'yyy';
	let txt = `aaa ${str1} bbb ${str2} ccc`;
}

// Задание 165. Запишите в переменную `str` строку, состоящую из символов `'a'`, `'b'`, `'c'`, причем после каждого символа, кроме последнего, должен стоять перенос строки.
{
	let str = `a
	b
	c`;
}

// Задание 151. Дана строка `'abcde'`. Обращаясь к отдельным символам этой строки выведите на экран символ `'a'`, символ `'c'`, символ `'e'`.
{
	let str = 'abcde';
	alert(str[0]); // 'a'
	alert(str[2]); // 'c'
	alert(str[4]); // 'e'
}

// Задание 152. Дана переменная со строкой `'abcde'`. Обращаясь к отдельным символам этой строки запишите в новую переменную символы этой строки в обратном порядке, то есть `'edcba'`.
{
	let str = 'abcde';
	let reversed = str[4] + str[3] + str[2] + str[1] + str[0];
	alert(reversed);
}

// Задание 153. Дана переменная `str` со строкой `'abcde'` и переменная `num` с номером символа. Выведите на экран символ, номер которого хранится в переменной `num`.
{
	let str = 'abcde';
	let num = 3;
	alert(str[num]);
}

// Задание 65. Дана строка. Выведите на экран ее последний символ.
{
	let str = 'abcde';
	let last = str[str.length - 1];
	alert(last);
}

// Задание 66. Дана строка. Выведите на экран ее предпоследний символ.
{
	let str = 'abcde';
	let prev = str[str.length - 2];
	alert(prev);
}

// Задание 67. Дана строка. Выведите на экран ее предпредпоследний символ.
{
	let str = 'abcde';
	let prev2 = str[str.length - 3];
	alert(prev2);
}

// Задание 49. Дана строка `'12345'`. Найдите сумму цифр этой строки.
{
	let str = '12345';
	let sum = Number(str[0]) + Number(str[1]) + Number(str[2]) + Number(str[3]) + Number(str[4]);
	alert(sum);
}

// Задание 154. Дана переменная с числом. Найдите количество цифр в этом числе.
{
	let num = 12345;
	alert(String(num).length);
}

// Задание 155. Даны две переменные с числами. Найдите количество цифр в одном и во втором числе, результаты сложите и выведите на экран.
{
	let num1 = 12345;
	let num2 = 678;
	let res = String(num1).length + String(num2).length;
	alert(res);
}

// Задание 157. Дано число `12345`. Найдите сумму цифр этого числа.
{
	let num = 12345;
	let str = String(num);
	let sum = Number(str[0]) + Number(str[1]) + Number(str[2]) + Number(str[3]) + Number(str[4]);
	alert(sum);
}

// Задание 158. Дано число `12345`. Найдите произведение цифр этого числа.
{
	let num = 12345;
	let str = String(num);
	let mult = str[0] * str[1] * str[2] * str[3] * str[4];
	alert(mult);
}

// Задание 159. Дано число `12345`. Переставьте цифры этого числа в обратном порядке.
{
	let num = 12345;
	let str = String(num);
	let reversed = str[4] + str[3] + str[2] + str[1] + str[0];
	alert(reversed);
}

// Задание 60. Проверьте, что будет результатом следующей операции: `alert(0.1 * 0.2);`
{
	alert(0.1 * 0.2);
}

// Задание 61. Проверьте, что будет результатом следующей операции: `alert(0.3 - 0.1);`
{
	alert(0.3 - 0.1);
}

// Задание 1. 
{
	let a = '5' + '2';
	alert(a);
}

// Задание 2. Не запуская код, определите, что выведется на экран: `let a = '5' + 2; alert(a);`
{
	let a = '5' + 2;
	alert(a);
}

// Задание 3. Не запуская код, определите, что выведется на экран: `let a = 5 + '2'; alert(a);`
{
	let a = 5 + '2';
	alert(a);
}

// Задание 4. Не запуская код, определите, что выведется на экран: `let a = 5 + 2; alert(a);`
{
	let a = 5 + 2;
	alert(a);
}

// Задание 5. Не запуская код, определите, что выведется на экран: `let a = '5' * '2'; alert(a);`
{
	let a = '5' * '2';
	alert(a);
}

// Задание 6. Не запуская код, определите, что выведется на экран: `let a = '5' - '2'; alert(a);`
{
	let a = '5' - '2';
	alert(a);
}

// Задание 7. Не запуская код, определите, что выведется на экран: `let a = '5' / '2'; alert(a);`
{
	let a = '5' / '2';
	alert(a);
}

// Задание 9. Не запуская код, определите, что выведется на экран: `let a = '5s' * '2'; alert(a);`
{
	let a = '5s' * '2';
	alert(a);
}

// Задание 10. Не запуская код, определите, что выведется на экран: `let a = '5s' + '2'; alert(a);`
{
	let a = '5s' + '2';
	alert(a);
}

// Задание 11. Не запуская код, определите, что выведется на экран: `let a = (-'5') + (-'2'); alert(a);`
{
	let a = (-'5') + (-'2');
	alert(a);
}

// Задание 12. Не запуская код, определите, что выведется на экран: `let a = '5' * 1 + '2' * 1; alert(a);`
{
	let a = '5' * 1 + '2' * 1;
	alert(a);
}

// Задание 13. Не запуская код, определите, что выведется на экран: `let a = '5' * '1' + '2' * '1'; alert(a);`
{
	let a = '5' * '1' + '2' * '1';
	alert(a);
}

// Задание 14. Не запуская код, определите, что выведется на экран: `let a = '' + 3 + 1; alert(a);`
{
	let a = '' + 3 + 1;
	alert(a);
}

// Задание 48. Даны две переменные с числами. Сложите значения этих переменных как строки и выведите результат на экран.
{
	let num1 = 1;
	let num2 = 2;
	alert(String(num1) + String(num2));
}

// Задание 44. Дана переменная `a` со значением `'10'` и переменная `b` со значением `'20'`. Сложите данные переменные как числа.
{
	let a = '10';
	let b = '20';
	let sum = Number(a) + Number(b);
	alert(sum);
}

// Задание 45. Не запуская код, определите, что выведется на экран: `alert( Number('2') + Number('3') );`
{
	alert( Number('2') + Number('3') );
}

// Задание 46. Не запуская код, определите, что выведется на экран: `alert( 2 + Number('3') );`
{
	alert( 2 + Number('3') );
}

// Задание 47. Не запуская код, определите, что выведется на экран: `alert( '2' + Number('3') );`
{
	alert( '2' + Number('3') );
}

// Задание 141. Не запуская код, определите, что выведется на экран: `let num1 = 3; let num2 = num1++; alert(num1); alert(num2);`
{
	let num1 = 3;
	let num2 = num1++;
	alert(num1); // 4
	alert(num2); // 3
}

// Задание 142. Не запуская код, определите, что выведется на экран: `let num1 = 3; let num2 = --num1; alert(num1); alert(num2);`
{
	let num1 = 3;
	let num2 = --num1;
	alert(num1); // 2
	alert(num2); // 2
}

// Задание 143. Не запуская код, определите, что выведется на экран: `let num1 = 3; let num2 = num1--; alert(num1); alert(num2);`
{
	let num1 = 3;
	let num2 = num1--;
	alert(num1); // 2
	alert(num2); // 3
}

// Задание 144. Не запуская код, определите, что выведется на экран: `let num1 = 3; num1++; let num2 = num1--; alert(num1++); alert(--num2);`
{
	let num1 = 3;
	num1++;
	let num2 = num1--;
	alert(num1++); // 3
	alert(--num2); // 3
}

// Задание 145. Спросите возраст пользователя с помощью функции `prompt`. Выведите с помощью `alert` введенный пользователем возраст.
{
	let age = prompt('Ваш возраст?');
	alert('Ваш возраст: ' + age);
}

// Задание 146. Переделайте приведенный выше код так, чтобы суммировались числа, а не строки.
{
	let num1 = prompt('Введите первое число');
	let num2 = prompt('Введите второе число');
	alert(Number(num1) + Number(num2));
}

// Задание 149. Дан код: `let a = '2'; let b = '3'; alert(a + b); // выведет '23'` С помощью описанного приема с плюсом исправьте приведенный код так, чтобы в переменные `a` и `b` присваивалось число, а не строка, ну и результатом, соответственно, было не `'23'`, а `5`.
{
	let a = +'2';
	let b = +'3';
	alert(a + b);
}

// Задание 23. Не запуская код, определите, что выведется на экран: `let test = Boolean(3); alert(test);`
{
	let test = Boolean(3);
	alert(test);
}

// Задание 24. Не запуская код, определите, что выведется на экран: `let test = Boolean(0); alert(test);`
{
	let test = Boolean(0);
	alert(test);
}

// Задание 25. Не запуская код, определите, что выведется на экран: `let test = Boolean(-1); alert(test);`
{
	let test = Boolean(-1);
	alert(test);
}

// Задание 26. Не запуская код, определите, что выведется на экран: `let test = Boolean(-0); alert(test);`
{
	let test = Boolean(-0);
	alert(test);
}

// Задание 27. Не запуская код, определите, что выведется на экран: `let test = Boolean(+0); alert(test);`
{
	let test = Boolean(+0);
	alert(test);
}

// Задание 28. Не запуская код, определите, что выведется на экран: `let test = Boolean('abc'); alert(test);`
{
	let test = Boolean('abc');
	alert(test);
}

// Задание 29. Не запуская код, определите, что выведется на экран: `let test = Boolean(''); alert(test);`
{
	let test = Boolean('');
	alert(test);
}

// Задание 30. Не запуская код, определите, что выведется на экран: `let test = Boolean('0'); alert(test);`
{
	let test = Boolean('0');
	alert(test);
}

// Задание 31. Не запуская код, определите, что выведется на экран: `let test = Boolean(true); alert(test);`
{
	let test = Boolean(true);
	alert(test);
}

// Задание 32. Не запуская код, определите, что выведется на экран: `let test = Boolean(false); alert(test);`
{
	let test = Boolean(false);
	alert(test);
}

// Задание 33. Не запуская код, определите, что выведется на экран: `let test = Boolean('true'); alert(test);`
{
	let test = Boolean('true');
	alert(test);
}

// Задание 34. Не запуская код, определите, что выведется на экран: `let test = Boolean('false'); alert(test);`
{
	let test = Boolean('false');
	alert(test);
}

// Задание 35. Не запуская код, определите, что выведется на экран: `let test = Boolean(null); alert(test);`
{
	let test = Boolean(null);
	alert(test);
}

// Задание 36. Не запуская код, определите, что выведется на экран: `let test = Boolean('null'); alert(test);`
{
	let test = Boolean('null');
	alert(test);
}

// Задание 37. Не запуская код, определите, что выведется на экран: `let test = Boolean(undefined); alert(test);`
{
	let test = Boolean(undefined);
	alert(test);
}

// Задание 38. Не запуская код, определите, что выведется на экран: `let test = Boolean('undefined'); alert(test);`
{
	let test = Boolean('undefined');
	alert(test);
}

// Задание 39. Не запуская код, определите, что выведется на экран: `let test = Boolean(NaN); alert(test);`
{
	let test = Boolean(NaN);
	alert(test);
}

// Задание 40. Не запуская код, определите, что выведется на экран: `let test = Boolean('NaN'); alert(test);`
{
	let test = Boolean('NaN');
	alert(test);
}

// Задание 41. Не запуская код, определите, что выведется на экран: `let test = Boolean(3 * 'abc'); alert(test);`
{
	let test = Boolean(3 * 'abc');
	alert(test);
}

// Задание 42. Не запуская код, определите, что выведется на экран: `let test = Boolean(Infinity); alert(test);`
{
	let test = Boolean(Infinity);
	alert(test);
}

// Задание 43. Не запуская код, определите, что выведется на экран: `let test = Boolean(1 / 0); alert(test);`
{
	let test = Boolean(1 / 0);
	alert(test);
}

// Задание 68. Не запуская код, определите, что выведется на экран: `alert(true + 3);`
{
	alert(true + 3);
}

// Задание 69. Не запуская код, определите, что выведется на экран: `alert(true + true);`
{
	alert(true + true);
}

// Задание 70. Не запуская код, определите, что выведется на экран: `alert(true - true);`
{
	alert(true - true);
}

// Задание 71. Не запуская код, определите, что выведется на экран: `alert(true + false);`
{
	alert(true + false);
}

// Задание 72. Не запуская код, определите, что выведется на экран: `alert('1' + true);`
{
	alert('1' + true);
}

// Задание 73. Не запуская код, определите, что выведется на экран: `alert( String(true) + 1 );`
{
	alert( String(true) + 1 );
}

// Задание 74. Не запуская код, определите, что выведется на экран: `alert( String(true) + Number(true) );`
{
	alert( String(true) + Number(true) );
}

// Задание 108. Дана переменная со значением `'5px'` и переменная со значением `'6px'`. Найдите сумму пикселей из значений этих переменных и выведите ее на экран.
{
	let a = '5px';
	let b = '6px';
	let sum = parseInt(a) + parseInt(b);
	alert(sum);
}

// Задание 109. Дана переменная со значением `'5.5px'` и переменная со значением `'6.25px'`. Найдите сумму пикселей из значений этих переменных и выведите ее на экран.
{
	let a = '5.5px';
	let b = '6.25px';
	let sum = parseFloat(a) + parseFloat(b);
	alert(sum);
}

// Задание 110. Модифицируйте предыдущую задачу так, чтобы к выводящемуся результату добавлялись буквы `'px'`. To есть, если наша сумма равна `11.75`, то на экран пусть выведется `'11.75px'`.
{
	let a = '5.5px';
	let b = '6.25px';
	let sum = parseFloat(a) + parseFloat(b);
	alert(sum + 'px');
}

// Задание 92. Код должен находить сумму чисел: `let num1 = 1; let num2 = 2; console.log('сумма: ' + num1 + num2);`
{
	let num1 = 1;
	let num2 = 2;
	console.log('сумма: ' + (num1 + num2));
}

// Задание 93. Код должен находить сумму чисел: `let a = 1; let b = 2; console.log(a + b + c);`
{
	let a = 1;
	let b = 2;
	let c = 0;
	console.log(a + b + c);
}

// Задание 94. Код должен находить сумму цифр числа: `let num = '123'; let sum = num[0] + num[1] + num[2]; console.log(sum);`
{
	let num = '123';
	let sum = Number(num[0]) + Number(num[1]) + Number(num[2]);
	console.log(sum);
}

// Задание 95. Код должен вывести первую цифру числа: `let num = 123; console.log(num[0]);`
{
	let num = 123;
	let str = String(num);
	console.log(str[0]);
}

// Задание 96. Код должен был вывести в консоль число `1`, но выводит `0`: `let a = 0; console.log(a++);`
{
	let a = 0;
	a++;
	console.log(a);
}

// Задание 97. Код должен вывести количество цифр в числе: `let num = 123; console.log(num.length);`
{
	let num = 123;
	console.log(String(num).length);
}

// Задание 98. Код должен найти количество секунд в сутках: `let a = 24 / 60 / 60; console.log(a);`
{
	let a = 24 * 60 * 60;
	console.log(a);
}

// Задание 99. Код должен вывести количество цифр в числе: `let num = 123; let str = String(num); console.log(num.length);`
{
	let num = 123;
	let str = String(num);
	console.log(str.length);
}

// Задание 100. Код должен вывести последнюю цифру числа: `let num = 123; let str = String(num); console.log(num[num.length]);`
{
	let num = 123;
	let str = String(num);
	console.log(str[str.length - 1]);
}

// Задание 101. Код должен вывести количество цифр в числе: `let num = 123; let str = String(num); console.log(str.lenght);`
{
	let num = 123;
	let str = String(num);
	console.log(str.length);
}

// Задание 102. Код должен вывести последнюю цифру числа: `let num = 123; let str = String(num); console.log(str[str.length]);`
{
	let num = 123;
	let str = String(num);
	console.log(str[str.length - 1]);
}

// Задание 103. Код должен найти сумму чисел: `let a = '123'; let b = '456'; let s = Number(a) + String(b); console.log(s);`
{
	let a = '123';
	let b = '456';
	let s = Number(a) + Number(b);
	console.log(s);
}

// Задание 22. Сделайте константу `PI` и с ее помощью вычислите длину какой-нибудь окружности по ее радиусу.
{
	const PI = 3.14;
	let radius = 10;
	let length = 2 * PI * radius;
	alert(length);
}

// Задание 104. Сделайте две строки. Перемножьте их друг на друга. Выведите результат умножения на экран.
{
	let str1 = 'abc';
	let str2 = 'def';
	alert(str1 * str2);
}

// Задание 107. Присвойте переменной значение `null`. Выведите эту переменную на экран.
{
	let a = null;
	alert(a);
}

// Задание 63. Поделите число `10` на `0`. Выведите результат на экран.
{
	alert(10 / 0);
}

// Задание 64. Поделите число `-10` на `0`. Выведите результат на экран.
{
	alert(-10 / 0);
}

// Задание 15. Присвойте переменной значение `true`. Выведите эту переменную на экран.
{
	let flag = true;
	alert(flag);
}

// Задание 16. Присвойте переменной значение `false`. Выведите эту переменную на экран.
{
	let flag = false;
	alert(flag);
}

// Задание 166. Объявите переменную, не задавая ей значения. Выведите значение созданной переменной на экран.
{
	let a;
	alert(a);
}

// Задание 150. Включите в вашем скрипте строгий режим.
{
	"use strict";

	let a = 1;
	alert(a);
}

// Задание 17. Попробуйте оба типа комментариев.
{
	// однострочный комментарий
	/*
		многострочный
	*/
	alert('text');
}

// Задание 20. Выведите в консоль все известные вам типы данных. Посмотрите, чем отличается их цвет.
{
	console.log(123);      // число
	console.log('123');    // строка
	console.log(true);     // логический тип
	console.log(undefined);// неопределённость
	console.log(null);     // ничего
	console.log(NaN);      // не число
	console.log(Infinity); // бесконечность
}

// Задание 120. Пусть дана переменная `r` с радиусом круга. По соответствующей формуле найдите площадь круга и запишите ее в переменную `s`. Выведите содержимое этой переменной на экран.
{
	let r = 10;
	let s = Math.PI * r ** 2;
	alert(s);
}

// Задание 121. Пусть дана переменная `a` со стороной квадрата. Найдите площадь квадрата и запишите ее в переменную `s`. Выведите содержимое этой переменной на экран.
{
	let a = 5;
	let s = a ** 2;
	alert(s);
}

// Задание 122. Пусть даны переменные `a` и `b` со сторонами прямоугольника. Найдите площадь прямоугольника и запишите ее в переменную `s`. Выведите содержимое этой переменной на экран.
{
	let a = 4;
	let b = 6;
	let s = a * b;
	alert(s);
}

// Задание 123. Пусть даны переменные `a` и `b` со сторонами прямоугольника. Найдите периметр прямоугольника и запишите его в переменную `p`. Выведите содержимое этой переменной на экран.
{
	let a = 4;
	let b = 6;
	let p = 2 * (a + b);
	alert(p);
}

// Задание 124. Пусть дана переменная `tc` с температурой в градусах Цельсия. По соответствующей формуле выполните перевод этой температуры в градусы Фаренгейта.
{
	let tc = 25;
	let tf = tc * 9 / 5 + 32;
	alert(tf);
}

// Задание 125. Пусть дана переменная `tf` с температурой в градусах Фаренгейта. По соответствующей формуле выполните перевод этой температуры в градусы Цельсия.
{
	let tf = 77;
	let tc = (tf - 32) * 5 / 9;
	alert(tc);
}

// Задание 126. Найдите количество секунд в сутках.
{
	alert(24 * 60 * 60);
}

// Задание 127. Найдите количество секунд в `30` сутках.
{
	alert(30 * 24 * 60 * 60);
}

// Задание 128. Найдите количество секунд в году.
{
	alert(365 * 24 * 60 * 60);
}

// Задание 129. Найдите количество минут в сутках.
{
	alert(24 * 60);
}

// Задание 130. Найдите количество минут в году.
{
	alert(365 * 24 * 60);
}

// Задание 131. Найдите количество байт в мегабайте.
{
	alert(1024 * 1024);
}

// Задание 132. Найдите количество байт в гигабайте.
{
	alert(1024 * 1024 * 1024);
}

// Задание 133. Найдите количество байт в `10` гигабайтах.
{
	alert(10 * 1024 * 1024 * 1024);
}

// Задание 134. Найдите количество байт в терабайте.
{
	alert(1024 * 1024 * 1024 * 1024);
}

// Задание 135. Найдите количество килобайт в терабайте.
{
	alert(1024 * 1024 * 1024);
}

// Задание 145. Спросите возраст пользователя с помощью функции `prompt`. Выведите с помощью `alert` введенный пользователем возраст.
{
	let age = prompt('Ваш возраст?');
	alert('Ваш возраст: ' + age);
}

// Задание 146. Переделайте приведенный выше код так, чтобы суммировались числа, а не строки.
{
	let num1 = prompt('Введите первое число');
	let num2 = prompt('Введите второе число');
	alert(Number(num1) + Number(num2));
}

// Задание 147. С помощью функции `prompt` спросите у пользователя сторону квадрата. Выведите на экран площадь введенного квадрата.
{
	let side = Number(prompt('Сторона квадрата?'));
	let s = side ** 2;
	alert(s);
}

// Задание 148. С помощью двух функций `prompt` спросите у пользователя стороны прямоугольника. Выведите на экран периметр введенного прямоугольника.
{
	let a = Number(prompt('Сторона a?'));
	let b = Number(prompt('Сторона b?'));
	let p = 2 * (a + b);
	alert(p);
}

// Задание 136. Не запуская код, определите, что выведется на экран: `let num = 3; alert(++num);`
{
	let num = 3;
	alert(++num);
}

// Задание 137. Не запуская код, определите, что выведется на экран: `let num = 3; alert(num++);`
{
	let num = 3;
	alert(num++);
}

// Задание 138. Не запуская код, определите, что выведется на экран: `let num = 3; alert(--num);`
{
	let num = 3;
	alert(--num);
}

// Задание 139. Не запуская код, определите, что выведется на экран: `let num = 3; alert(num--);`
{
	let num = 3;
	alert(num--);
}

// Задание 140. Не запуская код, определите, что выведется на экран: `let num1 = 3; let num2 = ++num1; alert(num1); alert(num2);`
{
	let num1 = 3;
	let num2 = ++num1;
	alert(num1); // 4
	alert(num2); // 4
}
